/* Переменная хранит в себе значение от 0 до 9. 
Написать скрипт который будет выводить слово “один”, если переменная хранит значение 1. 
Выводить слово “два” - если переменная хранит значение 2, и т.д. для всех цифр от 0 до 9. 
Реализовать двумя способами. 1-ый способ. */
let num = prompt("Введите число: ");
switch(num) {
case "1":
    alert("Один");
    break;
case "2":
    alert("Два");
    break;
case "3":
    alert("Три");
    break;
case "4":
    alert("Четыре");
    break;
case "5":
    alert("Пять");
    break;
case "6":
    alert("Шесть");
    break;
case "7":
    alert("Семь");
    break;
case "8":
    alert("Восемь");
    break;
case "9": 
    alert("Девять");
    break;
case "0":
    alert("Ноль");
    break;
default:
    alert("Введите число, которое входит в промежуток 0-9");
}