/* Переменная хранит в себе значение от 0 до 9. 
Написать скрипт который будет выводить слово “один”, если переменная хранит значение 1. 
Выводить слово “два” - если переменная хранит значение 2, и т.д. для всех цифр от 0 до 9. 
Реализовать двумя способами. 2-ой способ. */
let num = prompt("Введите число: ");
if(num == 1) {
    console.log("Один");
}
if(num == 2) {
    alert("Два");
}
if(num == 3) {
    alert("Три");
}
if(num == 4) {
    alert("Четыре");
}
if(num == 5) {
    console.log("Пять");
}
if(num == 6) {
    console.log("Шесть");
}
if(num == 7) {
    console.log("Семь");
}
if(num == 8) {
    console.log("Восемь");
}
if(num == 9) {
    console.log("Девять");
}
if(num == 0) {
    console.log("Ноль");
} else if (num > 9) {
    console.log("Введите число, которое входит в промежуток 0-9");
}
