/* Переменная хранит процент кредита, 
вторая переменная хранит объем тела кредита, 
третья переменная хранит длительность кредитного договора в годах. 
Написать скрипт который вычислит:
-Сколько процентов заплатит клиент за все время
-Сколько процентов заплатит клиент за один календарный год
-Какое общее количество денежных средств клиента банка выплатит за все года.
Реализовать при помощи функции. */
function calcCredit(percents, start, years) {
let start1 =  1000;
    start += (start * percents) * 12;
console.log((((start-start1) * 100) / 1000) + " - процент выплаты за 12 месяцев");
    start += (start * percents) * 48;
console.log((((start-start1) * 100) / 1000) + " - процент выплаты за " + years + " года");
console.log((start-start1) + " - кол-во денежных средств за все время");
}
calcCredit(0.04, 1000, 4);